Tekla Open API Reference for Tekla Structures 2025
PluginUserInterfaceAttribute Class
 The PluginUserInterfaceAttribute class is used for storing the description of the plug-in user interface to the system. The attribute is initialized from the custom attribute [PluginUserInterface(PluginName.UserInterfaceDefinitions.Plugin1)] in the plug-in source. In this case the description string Plugin1 is a dialog written in inp format. If the plug-in dialog is inherited from the PluginFormBase the description string contains a class name of the dialog i.e. [PluginUserInterface("Model_Plug_in1.MainForm")].
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PluginUserInterfaceAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PluginUserInterfaceAttribute : Attribute
Public NotInheritable Class PluginUserInterfaceAttribute
	Inherits Attribute
The PluginUserInterfaceAttribute type exposes the following members.
Constructors
Name | Description
PluginUserInterfaceAttribute
 The custom attribute [PluginUserInterface(PluginName.UserInterfaceDefinitions.Plugin1)] uses this to store the description of the plug-in user interface to the system. This is not to be used by itself.
Top
Properties
Name | Description
Description
 The description of the plug-in user interface in inp format.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace